update READNE
